### Resource changes jake-sltest [01K18RHA35YT0P4JFTYH0NTGMD] Planning changes with 0 custom hooks...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_instance.sd_instance will be created
  + resource "aws_instance" "sd_instance" {
      + ami                                  = "ami-04a81a99f5ec58529"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t2.medium"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ec2-key-pair"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "Stack Dependency EC2"
        }
      + tags_all                             = {
          + "Name" = "Stack Dependency EC2"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_key_pair.ssh_key will be created
  + resource "aws_key_pair" "ssh_key" {
      + arn             = (known after apply)
      + fingerprint     = (known after apply)
      + id              = (known after apply)
      + key_name        = "ec2-key-pair"
      + key_name_prefix = (known after apply)
      + key_pair_id     = (known after apply)
      + key_type        = (known after apply)
      + public_key      = "ssh-rsa AAAAB3NzaC1yc2EAAAADAQABAAACAQDL5wwgG7QZK3AYg382be/YLbg/3UIIDEDtkhBchbo5s13jo8Uuw08hvVfCdb6Kx6lKq3be180Vi8zFJV11Euri395SpbEvxvLL6w5JyDGCTEwiVUoNthUIGmH6jeefGa9N8xDr7My+ROfUGXvqjyOpjbPFbOiRXB8mMRO36nEswrtBLh1PB4ys962DeEZC8rPSfpzkjJoKeHnzRm0p24QnijrHNVScTeW3RR+kDjADiJ/ldyyKQLyev9J7PNvuRERvvoBYAjZnyjYh09KQWxGthGH4bYPjLJBZP2PRBztH/6uvYiBVdjtsHFz5ubgZnpeeLZmGg9l5X6PMIMww9//YGLYuwBH08ACVPUh7Y5s4ERlxex1GGn0nuD/JDTQgQemQtvKyb+zHBqkivqOVnLN8ekBKR4kQ67R8LrNHpkE1AjkMMqBK/APIIAWxF4hApykV/ma2LFcspmEkJQNuYvrhmyO3byILXuH7tLY2Tnd7opgkHq5bKtJTWi5edDVZcMD0CHuLGuk0HCipplGqjFhuxIL5faiXlZf/NANOPc6EQPTMDM1CzbBkv1Ty4j9iocsj+5LLKnYe5KJy7oLtsa7kZ99oeWXxSm1h3oqdAzFhK88G0J2Sa7kFqZDemlR0VvvGXGtDuxxZo8+p0E4QA2ZHw/gROXEUUiEmhPhZI8nzIw=="
      + tags_all        = (known after apply)
    }

  # aws_security_group.allow_access will be created
  + resource "aws_security_group" "allow_access" {
      + arn                    = (known after apply)
      + description            = "Allow SSH, HTTP and HTTPS traffic"
      + egress                 = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = ""
              + from_port        = 0
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "-1"
              + security_groups  = []
              + self             = false
              + to_port          = 0
            },
        ]
      + id                     = (known after apply)
      + ingress                = [
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 8000
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 8000
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTP"
              + from_port        = 80
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 80
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "HTTPS"
              + from_port        = 443
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 443
            },
          + {
              + cidr_blocks      = [
                  + "0.0.0.0/0",
                ]
              + description      = "SSH"
              + from_port        = 22
              + ipv6_cidr_blocks = []
              + prefix_list_ids  = []
              + protocol         = "tcp"
              + security_groups  = []
              + self             = false
              + to_port          = 22
            },
        ]
      + name                   = "stack-dependency-demo"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags                   = {
          + "Name" = "Stack Dependency EC2"
        }
      + tags_all               = {
          + "Name" = "Stack Dependency EC2"
        }
      + vpc_id                 = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_instance_ip = (known after apply)
[01K18RHA35YT0P4JFTYH0NTGMD] Changes are GO
[01K18RHA35YT0P4JFTYH0NTGMD] Uploading the list of managed resources...
[01K18RHA35YT0P4JFTYH0NTGMD] Generating Infracost JSON report from plan

[01K18RHA35YT0P4JFTYH0NTGMD] Infracost report generated successfully
[01K18RHA35YT0P4JFTYH0NTGMD] Mapping Infracost data to resources
[01K18RHA35YT0P4JFTYH0NTGMD] Costs mapped successfully
[01K18RHA35YT0P4JFTYH0NTGMD] Please be aware that the run changes calculation includes output changes.
[01K18RHA35YT0P4JFTYH0NTGMD] Resource list upload is GO
[01K18RHA35YT0P4JFTYH0NTGMD] Generating JSON representation of the plan...
[01K18RHA35YT0P4JFTYH0NTGMD] JSON representation is GO
[01K18RHA35YT0P4JFTYH0NTGMD] Generating Infracost JSON report from plan

[01K18RHA35YT0P4JFTYH0NTGMD] Infracost report generated successfully
[01K18RHA35YT0P4JFTYH0NTGMD] Loading custom plan policy inputs...
[01K18RHA35YT0P4JFTYH0NTGMD] 0 custom plan policy inputs found
[01K18RHA35YT0P4JFTYH0NTGMD] Evaluated 1 plan policy
[01K18RHA35YT0P4JFTYH0NTGMD] Plan checks are GO ec2-stack %!(EXTRA string=01K19AYQ6AK73PTMW4Y35AN53F, int=3, int=0, int=0)
| Added | `aws_instance.sd_instance` | <details><summary>Value</summary>`{"ami": "15d03948", "associate_public_ip_address": true, "credit_specification": [], "get_password_data": false, "hibernation": null, "instance_type": "21167e63", "key_name": "2da09d6d", "launch_template": [], "source_dest_check": true, "tags": {"Name": "285d533a"}, "tags_all": {"Name": "285d533a"}, "timeouts": null, "user_data_replace_on_change": false, "volume_tags": null}`</details> |
| Added | `aws_key_pair.ssh_key` | <details><summary>Value</summary>`{"key_name": "2da09d6d", "public_key": "f5539b54", "tags": null}`</details> |
| Added | `aws_security_group.allow_access` | <details><summary>Value</summary>`{"description": "05dc0c93", "egress": [{"cidr_blocks": ["c4c93144"], "description": "7852b855", "from_port": 0, "ipv6_cidr_blocks": [], "prefix_list_ids": [], "protocol": "7699c464", "security_groups": [], "self": false, "to_port": 0}], "ingress": [{"cidr_blocks": ["c4c93144"], "description": "ebdc6342", "from_port": 8000, "ipv6_cidr_blocks": [], "prefix_list_ids": [], "protocol": "dfee8b41", "security_groups": [], "self": false, "to_port": 8000}, {"cidr_blocks": ["c4c93144"], "description": "ebdc6342", "from_port": 80, "ipv6_cidr_blocks": [], "prefix_list_ids": [], "protocol": "dfee8b41", "security_groups": [], "self": false, "to_port": 80}, {"cidr_blocks": ["c4c93144"], "description": "ba9c37fc", "from_port": 443, "ipv6_cidr_blocks": [], "prefix_list_ids": [], "protocol": "dfee8b41", "security_groups": [], "self": false, "to_port": 443}, {"cidr_blocks": ["c4c93144"], "description": "55f97533", "from_port": 22, "ipv6_cidr_blocks": [], "prefix_list_ids": [], "protocol": "dfee8b41", "security_groups": [], "self": false, "to_port": 22}], "name": "db224f4c", "revoke_rules_on_delete": false, "tags": {"Name": "285d533a"}, "tags_all": {"Name": "285d533a"}, "timeouts": null}`</details> |
